file 1 benchmark.txt
====== PING_INLINE ======
  100000 requests completed in 1.29 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.40% <= 1 milliseconds
99.96% <= 2 milliseconds
100.00% <= 2 milliseconds
77700.08 requests per second

====== PING_BULK ======
  100000 requests completed in 1.20 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.98% <= 1 milliseconds
100.00% <= 1 milliseconds
83542.19 requests per second

====== SET ======
  100000 requests completed in 1.29 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.33% <= 1 milliseconds
100.00% <= 1 milliseconds
77459.34 requests per second

====== GET ======
  100000 requests completed in 1.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.53% <= 1 milliseconds
99.60% <= 2 milliseconds
99.65% <= 3 milliseconds
99.65% <= 4 milliseconds
99.75% <= 5 milliseconds
99.75% <= 6 milliseconds
99.77% <= 7 milliseconds
99.80% <= 8 milliseconds
99.85% <= 9 milliseconds
99.95% <= 10 milliseconds
100.00% <= 10 milliseconds
72568.94 requests per second

====== INCR ======
  100000 requests completed in 1.23 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.92% <= 1 milliseconds
100.00% <= 1 milliseconds
81037.28 requests per second

====== LPUSH ======
  100000 requests completed in 1.30 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

97.53% <= 1 milliseconds
99.85% <= 2 milliseconds
99.95% <= 8 milliseconds
100.00% <= 8 milliseconds
76804.91 requests per second

====== LPOP ======
  100000 requests completed in 1.27 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.64% <= 1 milliseconds
100.00% <= 1 milliseconds
78678.20 requests per second

====== SADD ======
  100000 requests completed in 1.23 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.69% <= 1 milliseconds
100.00% <= 1 milliseconds
81037.28 requests per second

====== SPOP ======
  100000 requests completed in 1.20 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

99.87% <= 1 milliseconds
100.00% <= 1 milliseconds
83402.84 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 1.29 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

98.29% <= 1 milliseconds
100.00% <= 1 milliseconds
77639.75 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 4.53 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

71.38% <= 1 milliseconds
98.35% <= 2 milliseconds
99.95% <= 3 milliseconds
99.97% <= 4 milliseconds
99.98% <= 398 milliseconds
100.00% <= 398 milliseconds
22060.45 requests per second